Autodesk.Revit.DB.Element.GetDependentElements(Autodesk.Revit.DB.ElementFilter)
Get all elements that, from a logical point of view, are the children of this Element.
Remarks:
The elements that this method will return:
Will be deleted if the input Element is deleted.Potentially could report the input Element as a host (there could be other type of
parent/child relationship here: for example view/view-specific elements, etc.)
filter:
What type of elements we are interested of.
Returns:
Logical children of this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1